Repository: Amaimersion/yandex-disk-telegram-bot
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: ru

source: success
ru: успешно

source: in progress
ru: в процессе

source: failed
ru: ошибка

source: unknown
ru: неизвестно

source: <b>Access to Yandex.Disk Granted</b> My access was attached to your Telegram account on %(date)s at %(time)s %(timezone)s. If it wasn't you, then detach this access with %(yd_revoke_command)s
ru: <b>Доступ к Яндекс.Диску получен</b> Мой доступ был прикреплен к вашему Telegram-аккаунту %(date)s в %(time)s %(timezone)s. Если это были не вы, то открепите этот доступ с помощью %(yd_revoke_command)s

source: Access Denied
ru: Доступ запрещен

source: You refused to grant me access to your Yandex.Disk.
ru: Вы отказались предоставить мне доступ к вашему Яндекс.Диску.

source: Application is unavailable
ru: Приложение недоступно

source: There is a problems with me. Try later please.
ru: В данный момент на моей стороне некоторые проблемы. Пожалуйста, попробуйте позже.

source: Invalid credentials
ru: Неверные учетные данные

source: Your credentials is not valid.
ru: Ваши учетные данные недействительны.

source: Your credentials is not valid anymore. Request a new authorization link.
ru: Ваши учетные данные больше недействительны. Запросите новую ссылку для авторизации.

source: Authorization link has expired
ru: У ссылки для авторизации истек срок действия

source: Your authorization link has expired. Request a new one.
ru: У вашей ссылки для авторизации истек срок действия. Запросите новую.

source: Internal server error
ru: Внутренняя ошибка сервера

source: At the moment i can't handle you because of my internal error. Try later please.
ru: В данный момент я не могу обработать вас из-за моей внутренней ошибки. Попробуйте позже, пожалуйста.

source: Status: pending
ru: Статус: ожидание

source: Failed to publish. Type to do it: %(publish_command)s %(full_path)s
ru: Не удалось опубликовать. Чтобы сделать это вручную, отправьте: %(publish_command)s %(full_path)s

source: Failed to get information. Type to do it: %(element_info_command)s %(full_path)s
ru: Не удалось получить информацию. Чтобы сделать это вручную, отправьте: %(element_info_command)s %(full_path)s

source: It is successfully uploaded, but i failed to perform some actions. You need to execute them manually.
ru: Это успешно загружено, но мне не удалось выполнить некоторые действия. Вам нужно выполнить их вручную.

source: Status: %(upload_status)s
ru: Статус: %(upload_status)s

source: I can't create default upload folder due to an unknown Yandex.Disk error.
ru: Я не могу создать папку загрузки по умолчанию из-за неизвестной ошибки Яндекс.Диска.

source: I can't upload this due to an unknown Yandex.Disk error.
ru: Я не могу загрузить это из-за неизвестной ошибки Яндекс.Диска.

source: I can't track operation status of this anymore. It can be uploaded after a while. Type to check: %(element_info_command)s %(full_path)s
ru: Я больше не могу отслеживать статус операции. Это может быть загружено через некоторое время. Чтобы проверить статус вручную, отправьте: %(element_info_command)s %(full_path)s

source: and publish
ru: и опубликовать

source: Send a photos that you want to upload%(publish_action)s. Note: - original name will be not saved - original quality and size will be decreased
ru: Отправьте фотографии, которые вы хотите загрузить%(publish_action)s. Обратите внимание: - исходное имя не будет сохранено - исходное качество и размер будут снижены

source: Send a files that you want to upload%(publish_action)s. Note: - original name will be saved - original quality and size will be saved
ru: Отправьте файлы, которые вы хотите загрузить%(publish_action)s. Обратите внимание: - исходное имя будет сохранено - исходное качество и размер будут сохранены

source: Send a music that you want to upload%(publish_action)s. Note: - original name will be saved - original quality and size will be saved - original type may be changed
ru: Отправьте музыку, которую вы хотите загрузить%(publish_action)s. Обратите внимание: - исходное имя будет сохранено - исходное качество и размер будут сохранены - исходный тип может быть изменен

source: Send a video that you want to upload%(publish_action)s. Note: - original name will be saved - original quality and size will be saved - original type may be changed
ru: Отправьте видео, которое вы хотите загрузить%(publish_action)s. Обратите внимание: - исходное имя будет сохранено - исходное качество и размер будут сохранены - исходный тип может быть изменен

source: Send a voice message that you want to upload%(publish_action)s.
ru: Отправьте голосовое сообщение, которое вы хотите загрузить%(publish_action)s.

source: Send a direct URL to file that you want to upload%(publish_action)s. Note: - original name from URL will be saved - original quality and size will be saved
ru: Отправьте прямую ссылку на файл, который вы хотите загрузить%(publish_action)s. Обратите внимание: - исходное имя по ссылке будет сохранено - исходное качество и размер будут сохранены

source: Send an URL to resource that you want to upload%(publish_action)s. Note: - for direct URL's to file original name, quality and size will be saved - for URL's to some resource best name and best possible quality will be selected - i will try to guess what resource you actually assumed. For example, you can send URL to YouTube video or Twitch clip, and video from that URL will be uploaded - you can send URL to any resource: video, audio, image, text, page, etc. Not everything will work as you expect, but some URL's will - i'm using youtube-dl, if that means anything to you (:
ru: Отправьте ссылку на ресурс, который вы хотите загрузить%(publish_action)s. Обратите внимание: - если это прямая ссылка на файл, то исходное качество и размер будут сохранены - если это ссылка на какой-то другой ресурс, то будут выбраны лучшее имя и лучшее возможное качество - я попытаюсь угадать, что именно вы подразумевали. Например, вы можете отправить ссылку на YouTube-видео или Twitch-клип, и видео по этой ссылке будет загружено - вы можете отправить ссылку на любой ресурс: видео, аудио, изображение, текст, страница и т.д. Не все будет работать так, как вы ожидаете, но что-то определенно будет работать - я использую youtube-dl, если это что-то значит для вас (:

source: a new path of default upload folder
ru: новый путь папки загрузки по умолчанию

source: Success. <code>%(old_value)s</code> was changed to <code>%(new_value)s</code>
ru: Успешно. <code>%(old_value)s</code> был изменен на <code>%(new_value)s</code>

source: Success.
ru: Успешно.

source: Public
ru: публичная

source: Private
ru: приватная

source: %(upload_name)s uploading will be used by default when you don't specify any commands.
ru: Если вы не укажете конкретную команду, то по умолчанию будет использоваться %(upload_name)s загрузка.

source: Choose a new language from the list below:
ru: Выберите новый язык из списка ниже:

source: Yes
ru: Да

source: No
ru: Нет

source: Given
ru: Предоставлен

source: Revoked
ru: Отозван

source: <b>Default upload folder:</b> <code>%(default_upload_folder)s</code> <b>Public upload by default:</b> %(public_upload_by_default)s <b>Language:</b> %(language)s <b>Yandex.Disk Access:</b> %(yd_access)s
ru: <b>Папка загрузки по умолчанию:</b> <code>%(default_upload_folder)s</code> <b>Публичная загрузка по умолчанию:</b> %(public_upload_by_default)s <b>Язык:</b> %(language)s <b>Доступ к Яндекс.Диску:</b> %(yd_access)s

source: Change default upload folder
ru: Изменить папку загрузки по умолчанию

source: Disable public upload by default
ru: Выключить публичную загрузку по умолчанию

source: Enable public upload by default
ru: Включить публичную загрузку по умолчанию

source: Change language
ru: Изменить язык

source: You waited too long. Send %(yd_auth_command)s again.
ru: Вы ожидали слишком долго. Отправьте %(yd_auth_command)s еще раз.

source: Your credentials is not valid. Try send %(yd_auth_command)s again.
ru: Ваши учетные данные недействительны. Попробуйте отправить %(yd_auth_command)s еще раз.

source: You have too many authorization sessions. Send %(yd_auth_command)s again and use only last link.
ru: У вас слишком много сессий авторизации. Отправьте %(yd_auth_command)s еще раз и используйте только последнюю ссылку.

source: Unknown error
ru: Неизвестная ошибка

source: Can't tell you more
ru: Больше ничего не могу вам сказать

source: <b>Yandex.OAuth Error</b> <b>Error</b>: %(title)s <b>Description</b>: %(description)s I still don't have access. Start new session using %(yd_auth_command)s
ru: <b>Ошибка Яндекс.OAuth</b> <b>Ошибка</b>: %(title)s <b>Описание</b>: %(description)s У меня все еще нет доступа. Начните новую сессию, используя %(yd_auth_command)s

source: You already grant me access to your Yandex.Disk. You can revoke my access with %(yd_auth_command)s
ru: Вы уже предоставили мне доступ к вашему Яндекс.Диску. Вы можете отозвать мой доступ с помощью %(yd_auth_command)s

source: <b>Access to Yandex.Disk Refreshed</b> Your granted access was refreshed automatically by me on %(date)s at %(time)s %(timezone)s. If it wasn't you, you can detach this access with %(yd_auth_command)s
ru: <b>Доступ к Яндекс.Диску обновлен</b> Предоставленный мне доступ был обновлен мной автоматически %(date)s в %(time)s %(timezone)s. Если это были не вы, то открепите этот доступ с помощью %(yd_auth_command)s

source: Grant access
ru: Предоставить доступ

source: Open special link by pressing on "%(open_link_button_text)s" button and grant me access to your Yandex.Disk. <b>IMPORTANT: don't give this link to anyone, because it contains your secret information.</b> <i>This link will expire in %(lifetime_in_minutes)s minutes.</i> <i>This link leads to Yandex page and redirects to bot page.</i> <b>It is safe to give the access?</b> Yes! I'm getting access only to your Yandex.Disk, not to your account. You can revoke my access at any time with %(revoke_command)s or in your <a href="%(yandex_passport_url)s">Yandex profile</a>. By the way, i'm <a href="%(source_code_url)s">open-source</a> and you can make sure that your data will be safe. You can even create your own bot with my functionality if using me makes you feel uncomfortable (: By using me, you accept <a href="%(privacy_policy_url)s">Privacy Policy</a> and <a href="%(terms_url)s">Terms of service</a>.
ru: Откройте специальную ссылку, нажав на кнопку "%(open_link_button_text)s", и предоставьте мне доступ к вашему Яндекс.Диску. <b>ВАЖНО: никому не давайте эту ссылку, потому что она содержит вашу конфиденциальную информацию.</b> <i>Срок действия этой ссылки закончится через %(lifetime_in_minutes)s минут.</i> <i>Это ссылка ведет на страницу Яндекса, а затем перенаправляет на страницу этого бота.</i> <b>Безопасно ли предоставлять доступ?</b> Да! Я получу доступ только к вашему Яндекс.Диску, а не ко всему аккаунту. Вы можете отозвать мой доступ в любое время с помощью %(revoke_command)s или в вашем <a href="%(yandex_passport_url)s">профиле на странице Яндекса</a>. Кроме того, мой <a href="%(source_code_url)s">исходный код</a> открыт, и вы можете убедиться, что ваши данные будут в безопасности. На основе этого кода можно создать даже своего собственного бота, если вам некомфортно использовать меня (: Используя меня, вы принимаете <a href="%(privacy_policy_url)s">Политику конфиденциальности</a> и <a href="%(terms_url)s">Условия использования сервиса</a>.

source: Open special link by pressing on "%(open_link_button_text)s" button and grant me access to your Yandex.Disk. <b>IMPORTANT: don't give this link to anyone, because it contains your secret information.</b> <i>This link will expire in %(lifetime_in_minutes)s minutes.</i> <i>This link leads to Yandex page. After granting access, you will need to send me the issued code.</i> <b>It is safe to give the access?</b> Yes! I'm getting access only to your Yandex.Disk, not to your account. You can revoke my access at any time with %(revoke_command)s or in your <a href="%(yandex_passport_url)s">Yandex profile</a>. By the way, i'm <a href="%(source_code_url)s">open-source</a> and you can make sure that your data will be safe. You can even create your own bot with my functionality if using me makes you feel uncomfortable (: By using me, you accept <a href="%(privacy_policy_url)s">Privacy Policy</a> and <a href="%(terms_url)s">Terms of service</a>.
ru: Откройте специальную ссылку, нажав на кнопку "%(open_link_button_text)s", и предоставьте мне доступ к вашему Яндекс.Диску. <b>ВАЖНО: никому не давайте эту ссылку, потому что она содержит вашу конфиденциальную информацию.</b> <i>Срок действия этой ссылки закончится через %(lifetime_in_minutes)s минут.</i> <i>Эта ссылка ведет на страницу Яндекса. После предоставления доступа вам нужно будет отправить мне выданный код.</i> <b>Безопасно ли предоставлять доступ?</b> Да! Я получу доступ только к вашему Яндекс.Диску, а не ко всему аккаунту. Вы можете отозвать мой доступ в любое время с помощью %(revoke_command)s или в вашем <a href="%(yandex_passport_url)s">профиле на странице Яндекса</a>. Кроме того, мой <a href="%(source_code_url)s">исходный код</a> открыт, и вы можете убедиться, что ваши данные будут в безопасности. На основе этого кода можно создать даже своего собственного бота, если вам некомфортно использовать меня (: Используя меня, вы принимаете <a href="%(privacy_policy_url)s">Политику конфиденциальности</a> и <a href="%(terms_url)s">Условия использования сервиса</a>.

source: Open this link, grant me an access and then send me a code
ru: Откройте эту ссылку, предоставьте мне доступ, а затем отправьте мне выданный код

source: <b>User — Name:</b> %(display_name)s
ru: <b>Пользователь — Имя:</b> %(display_name)s

source: <b>User — Login:</b> %(login)s
ru: <b>Пользователь — Логин:</b> %(login)s

source: <b>User — Country:</b> %(country)s
ru: <b>Пользователь — Страна:</b> %(country)s

source: <b>Paid:</b> %(status)s
ru: <b>Платный:</b> %(status)s

source: <b>Total space:</b> %(value)s
ru: <b>Доступно:</b> %(value)s

source: <b>Used space:</b> %(value)s
ru: <b>Использовано:</b> %(value)s

source: <b>Trash size:</b> %(value)s
ru: <b>Корзина:</b> %(value)s

source: <b>Free space:</b> %(value)s
ru: <b>Свободно:</b> %(value)s

source: <b>Maximum file size:</b> %(value)s
ru: <b>Максимальный размер файла:</b> %(value)s

source: bytes
ru: байт

source: Unpublished
ru: Публичный доступ закрыт

source: You can interact with <a href="https://disk.yandex.com">Yandex.Disk</a> by using me. To control me send following commands. Note: %(bullet_char)s you can change default upload folder using %(settings_command)s command, %(bullet_char)s maximum size of every upload (except URL) is %(file_size_limit_in_mb)s MB.
ru: Используйте меня для взаимодействия с <a href="https://disk.yandex.com">Яндекс.Диском</a>. Для управления отправляйте следующие команды. Обратите внимание: %(bullet_char)s вы можете изменить папку загрузки по умолчанию с помощью команды %(settings_command)s, %(bullet_char)s максимальный размер каждой загрузки (за исключением прямой ссылки на файл) %(file_size_limit_in_mb)s МБ.

source: I don't know this command. See commands list or type %(help_command)s
ru: Я не знаю эту команду. Посмотрите список команд или напишите %(help_command)s

source: You don't granted me access to your Yandex.Disk. You can do that with %(yd_auth_command)s
ru: Вы не предоставили мне доступ к вашему Яндекс.Диску. Вы можете сделать это с помощью %(yd_auth_command)s

source: <b>Access to Yandex.Disk Revoked</b> You successfully revoked my access to your Yandex.Disk on %(date)s at %(time)s %(timezone)s. Don't forget to do that in your <a href="https://passport.yandex.ru/profile">Yandex Profile</a>. To grant access again use %(yd_auth_command)s
ru: <b>Доступ к Яндекс.Диску отозван</b> Вы успешно отозвали мой доступ к вашему Яндекс.Диску %(date)s в %(time)s %(timezone)s. Не забудьте это сделать в вашем <a href="https://passport.yandex.ru/profile">профиле на странице Яндекса</a>. Чтобы заново предоставить мне доступ, используйте %(yd_auth_command)s

source: Generating...
ru: Создание...

source: Yandex.Disk space at %(current_utc_date)s
ru: Информация о размере Яндекс.Диска на %(current_utc_date)s

source: GB
ru: ГБ

source: Total
ru: Всего

source: Used Space
ru: Используемое место

source: Trash Size
ru: Размер корзины

source: Free Space
ru: Свободное место

source: Used
ru: Использовано

source: Trash
ru: Корзина

source: Free
ru: Свободно

source: I'm free and open-source bot that allows you to interact with Yandex.Disk through Telegram. Written by %(author)s
ru: Я бесплатный бот с открытым исходным кодом, который позволяет вам взаимодействовать с Яндекс.Диском через Телеграм. Автор: %(author)s

source: Source code
ru: Исходный код

source: Report a problem
ru: Сообщить о проблеме

source: Request a feature
ru: Попросить новую функцию

source: Ask a question
ru: Задать вопрос

source: Privacy Policy
ru: Политика конфиденциальности

source: Terms of service
ru: Условия использования сервиса

source: Download
ru: Скачать

source: Created
ru: Создано

source: Already exists
ru: Уже существует

source: Unknown operation status: %(last_status_code)s
ru: Неизвестный статус операции: %(last_status_code)s

source: <b>Name:</b> %(name)s
ru: <b>Имя:</b> %(name)s

source: Unknown
ru: Неизвестно

source: Folder
ru: Папка

source: File
ru: Файл

source: <b>Type:</b> %(type)s
ru: <b>Тип:</b> %(type)s

source: <b>Size:</b> %(size)s
ru: <b>Размер:</b> %(size)s

source: <b>Created:</b> %(date)s %(time)s %(timezone)s
ru: <b>Создано:</b> %(date)s %(time)s %(timezone)s

source: <b>Modified:</b> %(date)s %(time)s %(timezone)s
ru: <b>Изменено:</b> %(date)s %(time)s %(timezone)s

source: <b>Full path:</b> <code>%(path)s</code>
ru: <b>Полный путь:</b> <code>%(path)s</code>

source: <b>Origin path:</b> <code>%(path)s</code>
ru: <b>Исходный путь:</b> <code>%(path)s</code>

source: <b>Total elements:</b> %(count)s
ru: <b>Всего элементов:</b> %(count)s

source: <b>Public URL:</b> %(url)s
ru: <b>Публичная ссылка:</b> %(url)s

source: <b>Views:</b> %(count)s
ru: <b>Просмотров:</b> %(count)s

source: <b>Owner:</b> %(owner)s
ru: <b>Владелец:</b> %(owner)s

source: <b>Shared access — Owner:</b> %(status)s
ru: <b>Общий доступ — Владелец:</b> %(status)s

source: Full access
ru: Полный доступ

source: Read
ru: Чтение

source: Write
ru: Запись

source: <b>Shared access — Rights:</b> %(rights)s
ru: <b>Общий доступ — Права доступа:</b> %(rights)s

source: <b>Shared access — Root:</b> %(status)s
ru: <b>Общий доступ — Корневая папка:</b> %(status)s

source: I can't handle this because something is wrong.
ru: Я не могу это обработать, потому что что-то пошло не так.

source: I can't handle this because you didn't send any suitable data for that command.
ru: Я не могу это обработать, потому что вы не отправили мне никаких подходящих данных для этой команды.

source: I can't handle file of such a large size. At the moment my limit is %(limit_in_mb)s MB.
ru: Я не могу обработать файл такого большого размера. На данный момент мое ограничение составляет %(limit_in_mb)s МБ.

source: At the moment i can't process this because of my internal error. Try later please.
ru: На данный момент я не могу это обработать из-за моей внутренней ошибки. Пожалуйста, попробуйте позже.

source: I need to send you your secret information, but i don't know any private chat with you. First, contact me through private chat (direct message). After that repeat your request.
ru: Мне нужно отправить вам конфиденциальную информацию, но я не знаю никаких личных чатов с вами. Сначала свяжитесь со мной через личный чат (прямое сообщение). После этого повторите ваш запрос.

source: <b>Yandex.Disk Error</b> %(error_text)s
ru: <b>Ошибка Яндекс.Диска</b> %(error_text)s

source: Send a full path. It should starts from root directory, nested folders should be separated with "<code>%(separator)s</code>" character. In short, i expect an absolute path to the item. Example: <code>%(path_1)s</code> Example: <code>%(path_2)s</code>
ru: Отправьте полный путь. Он должен начинаться с корневной папки, вложенные папки должны быть разделены с помощью знака "<code>%(separator)s</code>". Вкратце, я ожидаю абсолютный (полный) путь к элементу. Пример: <code>%(path_1)s</code> Пример: <code>%(path_2)s</code>

source: a folder name
ru: имя папки

source: Send %(folder_name)s. It should starts from root directory, nested folders should be separated with "<code>%(separator)s</code>" character. In short, i expect a full path. Example: <code>%(path_1)s</code>
ru: Отправьте %(folder_name)s. Это должно начинаться с корневной папки, вложенные папки должны быть разделены с помощью знака "<code>%(separator)s</code>". Вкратце, я ожидаю абсолютный (полный) путь. Пример: <code>%(path_1)s</code>

source: Yandex.Disk
ru: Яндекс.Диск

source: upload a photo. Original name will be not saved, quality of photo will be decreased. You can send photo without this command. Use %(public_upload_command)s for public uploading
ru: загрузить фото. Исходное имя не будет сохранено, качество фото будет снижено. Вы можете отправлять фото без этой команды. Используйте %(public_upload_command)s для публичной загрузки

source: upload a file. Original name will be saved. For photos, original quality will be saved. You can send file without this command. Use %(public_upload_command)s for public uploading
ru: загрузить файл. Исходное имя будет сохранено. У фотографий исходное качество будет сохранено. Вы можете отправлять файлы без этой команды. Используйте %(public_upload_command)s для публичной загрузки

source: upload an audio. Original name will be saved, original type may be changed. You can send audio file without this command. Use %(public_upload_command)s for public uploading
ru: загрузить аудио. Исходное имя будет сохранено, исходный тип может быть изменен. Вы можете отправлять аудио без этой команды. Используйте %(public_upload_command)s для публичной загрузки

source: upload a video. Original name will be saved, original type may be changed. You can send video file without this command. Use %(public_upload_command)s for public uploading
ru: загрузить видео. Исходное имя будет сохранено, исходный тип может быть изменен. Вы можете отправлять видео без этой команды. Используйте %(public_upload_command)s для публичной загрузки

source: upload a voice. You can send voice file without this command. Use %(public_upload_command)s for public uploading
ru: загрузить голосовое сообщение. Вы можете отправлять голосовые сообщения без этой команды. Используйте %(public_upload_command)s для публичной загрузки

source: upload a some resource using URL. For direct URL's to file original name, quality and size will be saved. For URL's to some resource best name and best possible quality will be selected. "Resource" means anything: YouTube video, Twitch clip, music track, etc. Not everything will work as you expect, but some URL's will. See <a href="%(ytdl_url)s">this</a> for all supported sites. Use %(public_upload_command)s for public uploading
ru: загрузить какой-нибудь ресурс используя ссылку. Для прямых ссылок на файл исходное имя, качество и размер будут сохранены. Для остальных ссылок будет выбрано лучшее имя и лучшее возможное качество. "Ресурс" означает что угодно: YouTube-видео, Twitch-клип, музыкальный трек и т.д. Не все будет работать так, как вы ожидаете, но что-то точно будет работать. Смотрите <a href="%(ytdl_url)s">здесь</a> список всех поддерживаемых сайтов. Используйте %(public_upload_command)s для публичной загрузки

source: publish a file or folder that already exists. Send full name of element to publish with this command. Example: %(example)s
ru: опубликовать файл или папку. На момент публикации они должны существовать. Вместе с этой командой отправьте полное имя элемента, который нужно опубликовать. Пример: %(example)s
