Repository: Amaimersion/yandex-disk-telegram-bot
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: ru

source: unpublish a file or folder that already exists. Send full name of element to unpublish with this command. Example: %(example)s
ru: распубликовать файл или папку. На момент распубликации они должны существовать. Вместе с этой командой отправьте полное имя элемента, который нужно распубликовать. Пример: %(example)s

source: create a folder. Send folder name to create with this command. Folder name should starts from root, nested folders should be separated with "%(separator)s" character
ru: создать папку. Вместе с этой командой отправьте имя папки, которую нужно создать. Имя папки должно начинаться с корневной директории, вложенные папки должны быть разделены с помощью символа "%(separator)s"

source: get information about file or folder. Send full path of element with this command
ru: получить информацию о файле или папке. Вместе с этой командой отправьте полное имя элемента

source: get information about remaining space
ru: получить информацию об оставшемся месте

source: get information about your Yandex.Disk
ru: получить информацию о вашем Яндекс.Диске

source: Yandex.Disk Access
ru: Доступ к Яндекс.Диску

source: grant me access to your Yandex.Disk
ru: предоставить мне доступ к вашему Яндекс.Диску

source: revoke my access to your Yandex.Disk
ru: отозвать мой доступ к вашему Яндекс.Диску

source: Settings
ru: Настройки

source: edit your settings
ru: изменить ваши настройки

source: Information
ru: Информация

source: read about me
ru: прочитать обо мне

source: see full list of available commands without help message
ru: просмотреть полный список доступных команд без этого вспомогательного сообщения

source: Success
ru: Успешно

source: You've successfully granted an access to %(project_name)s.
ru: Вы успешно предоставили доступ %(project_name)s.

source: Authorization Failed
ru: Не удалось авторизоваться

source: Unknown Error
ru: Неизвестная ошибка

source: Granting of access to %(project_name)s failed due to an unknown error.
ru: Не удалось предоставить доступ %(project_name)s из-за неизвестной ошибки.

source: report a problem
ru: сообщить о проблеме

source: You may %(action)s. Here is a data for debugging purposes:
ru: Вы можете %(action)s. Вот данные для отладки:

source: Title: %(title)s
ru: Название: %(title)s

source: Description: %(description)s
ru: Описание: %(description)s

source: State: %(state)s
ru: Состояние: %(state)s
